<template>
  <div>
    <page-card :tabs="tabs" is-card-page card-title="Мои заказы" />
  </div>
</template>

<script>
import PageCard from '~/components/Pages/Card/PageCard'

export default {
  components: {
    PageCard,
  },

  data() {
    return {
      tabs: [
        {
          title: 'Активные заказы',
          card: [
            {
              image: 'https://picsum.photos/400/400/?image=20',
              title: 'Фотоальбом 1',
              text:
                'Твердый переплет с текстурой ткани из стильного дизайнерского материала',
            },
            {
              image: 'https://picsum.photos/400/400/?image=21',
              title: 'Фотоальбом 2',
              text:
                'Твердый переплет с текстурой ткани из стильного дизайнерского материала',
            },
            {
              image: 'https://picsum.photos/400/400/?image=22',
              title: 'Фотоальбом 3',
              text:
                'Твердый переплет с текстурой ткани из стильного дизайнерского материала',
            },
            {
              image: 'https://picsum.photos/400/400/?image=23',
              title: 'Фотоальбом 4',
              text:
                'Твердый переплет с текстурой ткани из стильного дизайнерского материала',
            },
            {
              image: 'https://picsum.photos/400/400/?image=24',
              title: 'Фотоальбом 5',
              text:
                'Твердый переплет с текстурой ткани из стильного дизайнерского материала',
            },
            {
              image: 'https://picsum.photos/400/400/?image=37',
              title: 'Фотоальбом 6',
              text:
                'Твердый переплет с текстурой ткани из стильного дизайнерского материала',
            },
            {
              image: 'https://picsum.photos/400/400/?image=36',
              title: 'Фотоальбом 7',
              text:
                'Твердый переплет с текстурой ткани из стильного дизайнерского материала',
            },
          ],
          resourceName: 'my_orders',
        },
        {
          title: 'Закрытые заказы',
          card: [
            {
              image: 'https://picsum.photos/400/400/?image=37',
              title: 'Фотоальбом 6',
              text:
                'Твердый переплет с текстурой ткани из стильного дизайнерского материала',
            },
            {
              image: 'https://picsum.photos/400/400/?image=36',
              title: 'Фотоальбом 7',
              text:
                'Твердый переплет с текстурой ткани из стильного дизайнерского материала',
            },
            {
              image: 'https://picsum.photos/400/400/?image=35',
              title: 'Фотоальбом 8',
              text:
                'Твердый переплет с текстурой ткани из стильного дизайнерского материала',
            },
            {
              image: 'https://picsum.photos/400/400/?image=34',
              title: 'Фотоальбом 9',
              text:
                'Твердый переплет с текстурой ткани из стильного дизайнерского материала',
            },
            {
              image: 'https://picsum.photos/400/400/?image=33',
              title: 'Фотоальбом 10',
              text:
                'Твердый переплет с текстурой ткани из стильного дизайнерского материала',
            },
            {
              image: 'https://picsum.photos/400/400/?image=32',
              title: 'Фотоальбом 11',
              text:
                'Твердый переплет с текстурой ткани из стильного дизайнерского материала',
            },
            {
              image: 'https://picsum.photos/400/400/?image=31',
              title: 'Фотоальбом 12',
              text:
                'Твердый переплет с текстурой ткани из стильного дизайнерского материала',
            },
            {
              image: 'https://picsum.photos/400/400/?image=29',
              title: 'Фотоальбом 13',
              text:
                'Твердый переплет с текстурой ткани из стильного дизайнерского материала',
            },
            {
              image: 'https://picsum.photos/400/400/?image=28',
              title: 'Фотоальбом 14',
              text:
                'Твердый переплет с текстурой ткани из стильного дизайнерского материала, украшенный металлизированным тиснением из нашей коллекции, надежно сохранит яркие моменты Вашей жизни.',
            },
            {
              image: 'https://picsum.photos/400/400/?image=27',
              title: 'Фотоальбом 15',
              text:
                'Твердый переплет с текстурой ткани из стильного дизайнерского материала, украшенный металлизированным тиснением из нашей коллекции, надежно сохранит яркие моменты Вашей жизни.',
            },
            {
              image: 'https://picsum.photos/400/400/?image=21',
              title: 'Фотоальбом 2',
              text:
                'Твердый переплет с текстурой ткани из стильного дизайнерского материала, украшенный металлизированным тиснением из нашей коллекции, надежно сохранит яркие моменты Вашей жизни.',
            },
            {
              image: 'https://picsum.photos/400/400/?image=22',
              title: 'Фотоальбом 3',
              text:
                'Твердый переплет с текстурой ткани из стильного дизайнерского материала, украшенный металлизированным тиснением из нашей коллекции, надежно сохранит яркие моменты Вашей жизни.',
            },
            {
              image: 'https://picsum.photos/400/400/?image=23',
              title: 'Фотоальбом 4',
              text:
                'Твердый переплет с текстурой ткани из стильного дизайнерского материала, украшенный металлизированным тиснением из нашей коллекции, надежно сохранит яркие моменты Вашей жизни.',
            },
            {
              image: 'https://picsum.photos/400/400/?image=24',
              title: 'Фотоальбом 5',
              text:
                'Твердый переплет с текстурой ткани из стильного дизайнерского материала, украшенный металлизированным тиснением из нашей коллекции, надежно сохранит яркие моменты Вашей жизни.',
            },
            {
              image: 'https://picsum.photos/400/400/?image=37',
              title: 'Фотоальбом 6',
              text:
                'Твердый переплет с текстурой ткани из стильного дизайнерского материала, украшенный металлизированным тиснением из нашей коллекции, надежно сохранит яркие моменты Вашей жизни.',
            },
            {
              image: 'https://picsum.photos/400/400/?image=36',
              title: 'Фотоальбом 7',
              text:
                'Твердый переплет с текстурой ткани из стильного дизайнерского материала, украшенный металлизированным тиснением из нашей коллекции, надежно сохранит яркие моменты Вашей жизни.',
            },
            {
              image: 'https://picsum.photos/400/400/?image=35',
              title: 'Фотоальбом 8',
              text:
                'Твердый переплет с текстурой ткани из стильного дизайнерского материала, украшенный металлизированным тиснением из нашей коллекции, надежно сохранит яркие моменты Вашей жизни.',
            },
            {
              image: 'https://picsum.photos/400/400/?image=34',
              title: 'Фотоальбом 9',
              text:
                'Твердый переплет с текстурой ткани из стильного дизайнерского материала, украшенный металлизированным тиснением из нашей коллекции, надежно сохранит яркие моменты Вашей жизни.',
            },
            {
              image: 'https://picsum.photos/400/400/?image=33',
              title: 'Фотоальбом 10',
              text:
                'Твердый переплет с текстурой ткани из стильного дизайнерского материала, украшенный металлизированным тиснением из нашей коллекции, надежно сохранит яркие моменты Вашей жизни.',
            },
            {
              image: 'https://picsum.photos/400/400/?image=32',
              title: 'Фотоальбом 11',
              text:
                'Твердый переплет с текстурой ткани из стильного дизайнерского материала, украшенный металлизированным тиснением из нашей коллекции, надежно сохранит яркие моменты Вашей жизни.',
            },
            {
              image: 'https://picsum.photos/400/400/?image=31',
              title: 'Фотоальбом 12',
              text:
                'Твердый переплет с текстурой ткани из стильного дизайнерского материала, украшенный металлизированным тиснением из нашей коллекции, надежно сохранит яркие моменты Вашей жизни.',
            },
            {
              image: 'https://picsum.photos/400/400/?image=29',
              title: 'Фотоальбом 13',
              text:
                'Твердый переплет с текстурой ткани из стильного дизайнерского материала, украшенный металлизированным тиснением из нашей коллекции, надежно сохранит яркие моменты Вашей жизни.',
            },
            {
              image: 'https://picsum.photos/400/400/?image=28',
              title: 'Фотоальбом 14',
              text:
                'Твердый переплет с текстурой ткани из стильного дизайнерского материала, украшенный металлизированным тиснением из нашей коллекции, надежно сохранит яркие моменты Вашей жизни.',
            },
            {
              image: 'https://picsum.photos/400/400/?image=27',
              title: 'Фотоальбом 15',
              text:
                'Твердый переплет с текстурой ткани из стильного дизайнерского материала, украшенный металлизированным тиснением из нашей коллекции, надежно сохранит яркие моменты Вашей жизни.',
            },
          ],
          resourceName: 'my_orders',
        },
        {
          title: 'Все заказы',
          card: [
            {
              image: 'https://picsum.photos/400/400/?image=20',
              title: 'Фотоальбом 1',
              text:
                'Твердый переплет с текстурой ткани из стильного дизайнерского материала',
            },
            {
              image: 'https://picsum.photos/400/400/?image=21',
              title: 'Фотоальбом 2',
              text:
                'Твердый переплет с текстурой ткани из стильного дизайнерского материала',
            },
            {
              image: 'https://picsum.photos/400/400/?image=22',
              title: 'Фотоальбом 3',
              text:
                'Твердый переплет с текстурой ткани из стильного дизайнерского материала',
            },
            {
              image: 'https://picsum.photos/400/400/?image=23',
              title: 'Фотоальбом 4',
              text:
                'Твердый переплет с текстурой ткани из стильного дизайнерского материала',
            },
            {
              image: 'https://picsum.photos/400/400/?image=24',
              title: 'Фотоальбом 5',
              text:
                'Твердый переплет с текстурой ткани из стильного дизайнерского материала',
            },
            {
              image: 'https://picsum.photos/400/400/?image=37',
              title: 'Фотоальбом 6',
              text:
                'Твердый переплет с текстурой ткани из стильного дизайнерского материала, украшенный металлизированным тиснением из нашей коллекции, надежно сохранит яркие моменты Вашей жизни.',
            },
            {
              image: 'https://picsum.photos/400/400/?image=36',
              title: 'Фотоальбом 7',
              text:
                'Твердый переплет с текстурой ткани из стильного дизайнерского материала, украшенный металлизированным тиснением из нашей коллекции, надежно сохранит яркие моменты Вашей жизни.',
            },
            {
              image: 'https://picsum.photos/400/400/?image=35',
              title: 'Фотоальбом 8',
              text:
                'Твердый переплет с текстурой ткани из стильного дизайнерского материала, украшенный металлизированным тиснением из нашей коллекции, надежно сохранит яркие моменты Вашей жизни.',
            },
            {
              image: 'https://picsum.photos/400/400/?image=34',
              title: 'Фотоальбом 9',
              text:
                'Твердый переплет с текстурой ткани из стильного дизайнерского материала, украшенный металлизированным тиснением из нашей коллекции, надежно сохранит яркие моменты Вашей жизни.',
            },
            {
              image: 'https://picsum.photos/400/400/?image=33',
              title: 'Фотоальбом 10',
              text:
                'Твердый переплет с текстурой ткани из стильного дизайнерского материала, украшенный металлизированным тиснением из нашей коллекции, надежно сохранит яркие моменты Вашей жизни.',
            },
            {
              image: 'https://picsum.photos/400/400/?image=32',
              title: 'Фотоальбом 11',
              text:
                'Твердый переплет с текстурой ткани из стильного дизайнерского материала, украшенный металлизированным тиснением из нашей коллекции, надежно сохранит яркие моменты Вашей жизни.',
            },
            {
              image: 'https://picsum.photos/400/400/?image=31',
              title: 'Фотоальбом 12',
              text:
                'Твердый переплет с текстурой ткани из стильного дизайнерского материала, украшенный металлизированным тиснением из нашей коллекции, надежно сохранит яркие моменты Вашей жизни.',
            },
            {
              image: 'https://picsum.photos/400/400/?image=29',
              title: 'Фотоальбом 13',
              text:
                'Твердый переплет с текстурой ткани из стильного дизайнерского материала, украшенный металлизированным тиснением из нашей коллекции, надежно сохранит яркие моменты Вашей жизни.',
            },
            {
              image: 'https://picsum.photos/400/400/?image=28',
              title: 'Фотоальбом 14',
              text:
                'Твердый переплет с текстурой ткани из стильного дизайнерского материала, украшенный металлизированным тиснением из нашей коллекции, надежно сохранит яркие моменты Вашей жизни.',
            },
            {
              image: 'https://picsum.photos/400/400/?image=27',
              title: 'Фотоальбом 15',
              text:
                'Твердый переплет с текстурой ткани из стильного дизайнерского материала, украшенный металлизированным тиснением из нашей коллекции, надежно сохранит яркие моменты Вашей жизни.',
            },
            {
              image: 'https://picsum.photos/400/400/?image=21',
              title: 'Фотоальбом 2',
              text:
                'Твердый переплет с текстурой ткани из стильного дизайнерского материала, украшенный металлизированным тиснением из нашей коллекции, надежно сохранит яркие моменты Вашей жизни.',
            },
            {
              image: 'https://picsum.photos/400/400/?image=22',
              title: 'Фотоальбом 3',
              text:
                'Твердый переплет с текстурой ткани из стильного дизайнерского материала, украшенный металлизированным тиснением из нашей коллекции, надежно сохранит яркие моменты Вашей жизни.',
            },
            {
              image: 'https://picsum.photos/400/400/?image=23',
              title: 'Фотоальбом 4',
              text:
                'Твердый переплет с текстурой ткани из стильного дизайнерского материала, украшенный металлизированным тиснением из нашей коллекции, надежно сохранит яркие моменты Вашей жизни.',
            },
            {
              image: 'https://picsum.photos/400/400/?image=24',
              title: 'Фотоальбом 5',
              text:
                'Твердый переплет с текстурой ткани из стильного дизайнерского материала, украшенный металлизированным тиснением из нашей коллекции, надежно сохранит яркие моменты Вашей жизни.',
            },
            {
              image: 'https://picsum.photos/400/400/?image=37',
              title: 'Фотоальбом 6',
              text:
                'Твердый переплет с текстурой ткани из стильного дизайнерского материала, украшенный металлизированным тиснением из нашей коллекции, надежно сохранит яркие моменты Вашей жизни.',
            },
            {
              image: 'https://picsum.photos/400/400/?image=36',
              title: 'Фотоальбом 7',
              text:
                'Твердый переплет с текстурой ткани из стильного дизайнерского материала, украшенный металлизированным тиснением из нашей коллекции, надежно сохранит яркие моменты Вашей жизни.',
            },
            {
              image: 'https://picsum.photos/400/400/?image=35',
              title: 'Фотоальбом 8',
              text:
                'Твердый переплет с текстурой ткани из стильного дизайнерского материала, украшенный металлизированным тиснением из нашей коллекции, надежно сохранит яркие моменты Вашей жизни.',
            },
            {
              image: 'https://picsum.photos/400/400/?image=34',
              title: 'Фотоальбом 9',
              text:
                'Твердый переплет с текстурой ткани из стильного дизайнерского материала, украшенный металлизированным тиснением из нашей коллекции, надежно сохранит яркие моменты Вашей жизни.',
            },
            {
              image: 'https://picsum.photos/400/400/?image=33',
              title: 'Фотоальбом 10',
              text:
                'Твердый переплет с текстурой ткани из стильного дизайнерского материала, украшенный металлизированным тиснением из нашей коллекции, надежно сохранит яркие моменты Вашей жизни.',
            },
            {
              image: 'https://picsum.photos/400/400/?image=32',
              title: 'Фотоальбом 11',
              text:
                'Твердый переплет с текстурой ткани из стильного дизайнерского материала, украшенный металлизированным тиснением из нашей коллекции, надежно сохранит яркие моменты Вашей жизни.',
            },
            {
              image: 'https://picsum.photos/400/400/?image=31',
              title: 'Фотоальбом 12',
              text:
                'Твердый переплет с текстурой ткани из стильного дизайнерского материала, украшенный металлизированным тиснением из нашей коллекции, надежно сохранит яркие моменты Вашей жизни.',
            },
            {
              image: 'https://picsum.photos/400/400/?image=29',
              title: 'Фотоальбом 13',
              text:
                'Твердый переплет с текстурой ткани из стильного дизайнерского материала, украшенный металлизированным тиснением из нашей коллекции, надежно сохранит яркие моменты Вашей жизни.',
            },
            {
              image: 'https://picsum.photos/400/400/?image=28',
              title: 'Фотоальбом 14',
              text:
                'Твердый переплет с текстурой ткани из стильного дизайнерского материала, украшенный металлизированным тиснением из нашей коллекции, надежно сохранит яркие моменты Вашей жизни.',
            },
            {
              image: 'https://picsum.photos/400/400/?image=27',
              title: 'Фотоальбом 15',
              text:
                'Твердый переплет с текстурой ткани из стильного дизайнерского материала, украшенный металлизированным тиснением из нашей коллекции, надежно сохранит яркие моменты Вашей жизни.',
            },
          ],
          resourceName: 'my_orders',
        },
      ],
    }
  },
}
</script>
